
# Exercise 3 SQLite # Refrential integrity

Refrential Integrity is used to maintian the data consistency between two tables. rules are made in the database structure about
how foreign keys should be used to ensure that changes, addition and deletion in the database maintain the data integity. the
the referntial integrity constrins state that if a foreign key in the first table refers to the primary key of the second table 
then every value of foreign key in the first table should either be null or present in the second table.

In [1]:
import sqlite3

In [2]:
db=sqlite3.connect("E:/bhupendra/student_course_database.db")

In [3]:
cur=db.cursor()

constraints-----
unique -- enter only unique values, no duplicate values
not null --no blank values inserted in table

In [5]:
cur.execute("create table course(courseid int primary key , coursename text,duration int)")

In [4]:
cur.execute("create table student(roll_no int primary key,studentname text,age int,courseid int,foreign key(courseid) references course(courseid))")

In [5]:
cur.execute("insert into course values(78,'data science',12),(56,'python course',4),(101,'database',7)")

print(cur.rowcount,"record(s) inserted ")

db.commit;

3 record(s) inserted

In [6]:
cur.execute("insert into student values(1,'jack',22,78),(2,'john',21,56),(3,'rudolf',18,78),(4,'jim',21,56)")

print(cur.rowcount,"record(s) inserted ")

db.commit;

4 record(s) inserted

In [11]:
results=cur.execute('select * from course')

results.fetchall()

[(78, 'data science', 12), (56, 'python course', 4), (101, 'database', 7)]

In [8]:
results=cur.execute('select * from student')

results.fetchall()

[(1, 'jack', 22, 78),
 (2, 'john', 21, 56),
 (3, 'rudolf', 18, 78),
 (4, 'jim', 21, 56)]

In [10]:
results=cur.execute('select courseid from course where coursename ="data science"')

for i in results:
    print(i)

(78,)

# Subquery

query  with in query = Subquery

In [14]:
results=cur.execute('select * from student where courseid=(select courseid from course where coursename="data science")')

results.fetchall()

[(1, 'jack', 22, 78), (3, 'rudolf', 18, 78)]

In [15]:
results=cur.execute('select * from student where courseid=(select courseid from course where coursename="python course")')

results.fetchall()

[(2, 'john', 21, 56), (4, 'jim', 21, 56)]

Join

Defferent Types of SQL JOINs

1 (INNER)JOIN: Returns records that have maching values in both tables.
2 LEFT (OUTER) JOIN: Returns all records from the left table, and the matched records from the right table
3 RIGHT (OUTER) JOIN: Returns all records from the right table, and the matched records from the left table
4 FULL(OUTER)JOIN:  Rerturns all records when there is a match in either left or right table

# INNER JOIN

In [16]:
sql= "SELECT student.roll_no, student.studentname, course.courseid, course.coursename FROM student INNER JOIN course ON student.courseid = course.courseid"

results = cur.execute(sql)
for row in results:
    print(row)

(1, 'jack', 78, 'data science')
(2, 'john', 56, 'python course')
(3, 'rudolf', 78, 'data science')
(4, 'jim', 56, 'python course')

# LEFT JOIN

In [17]:
sql= "SELECT student.roll_no, student.studentname, course.courseid, course.coursename FROM student LEFT JOIN course ON student.courseid = course.courseid"

results = cur.execute(sql)
for row in results:
    print(row)

(1, 'jack', 78, 'data science')
(2, 'john', 56, 'python course')
(3, 'rudolf', 78, 'data science')
(4, 'jim', 56, 'python course')

In [20]:
sql= "SELECT student.roll_no, student.studentname, course.courseid,course.coursename FROM course LEFT JOIN student ON student.courseid = course.courseid"

results = cur.execute(sql)
for row in results:
    print(row)

(1, 'jack', 78, 'data science')
(3, 'rudolf', 78, 'data science')
(2, 'john', 56, 'python course')
(4, 'jim', 56, 'python course')
(None, None, 101, 'database')

RIGHT JOIN and FULL OUTER JOIN NOT SUPPORTED IN SQLITE